Catalogs/КСУ_ИнструкцииКЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КСУ_ИнструкцииКЗаказам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КСУ_ИнструкцииКЗаказам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ВложенияСтруктура = Неопределено;
	Определение = объект.Инструкция;
	
	Если ЗначениеЗаполнено(Определение) Тогда
		
		Если ВложенияСтруктура = Неопределено Тогда
			ВложенияСтруктура = Новый Структура;
		КонецЕсли;
		ФорматДок.УстановитьHTML(Определение, ВложенияСтруктура);
		
	КонецЕсли;

	Элементы.Организация.Видимость = объект.Ссылка <> ПредопределенноеЗначение("Справочник.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций") ;
	
	м = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Если (не объект.Организация.Пустая()) и м.найти(объект.Организация) = Неопределено тогда
		м.добавить(объект.Организация);
	КонецЕсли;
	Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(м);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВложенияСтруктура = Новый Структура;
	Определение ="";
	ФорматДок.ПолучитьHTML(Определение, ВложенияСтруктура);
	
	Вложения = Новый ХранилищеЗначения(ВложенияСтруктура);
	
	ТекущийОбъект.Инструкция = Определение;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если объект.Ссылка <> ПредопределенноеЗначение("Справочник.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций") тогда
		Объект.Наименование = "Инструкция для организации """+объект.Организация+"""";
	КонецЕсли;
КонецПроцедуры
